backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_1
    - 0
    - 0
  - - input_2
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 13
      - 128
      - 128
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 2
      - 128
      - 128
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: Concatenate
    config:
      axis: 1
      name: concatenate_1
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - &id001 {}
      - - input_2
        - 0
        - 0
        - *id001
    name: concatenate_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: &id002 !!python/tuple
      - 1
      - 1
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: &id019 !!python/tuple
      - 3
      - 3
      name: conv2d_1
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: Activation
    config:
      activation: relu
      name: activation_1
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_2
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: Activation
    config:
      activation: relu
      name: activation_2
      trainable: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_3
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_1
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: lambda_1
  - class_name: Add
    config:
      name: add_1
      trainable: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - &id003 {}
      - - lambda_1
        - 0
        - 0
        - *id003
    name: add_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_4
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: Activation
    config:
      activation: relu
      name: activation_3
      trainable: true
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_5
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_2
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: lambda_2
  - class_name: Add
    config:
      name: add_2
      trainable: true
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - &id004 {}
      - - lambda_2
        - 0
        - 0
        - *id004
    name: add_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_6
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: Activation
    config:
      activation: relu
      name: activation_4
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_7
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_3
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: lambda_3
  - class_name: Add
    config:
      name: add_3
      trainable: true
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - &id005 {}
      - - lambda_3
        - 0
        - 0
        - *id005
    name: add_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_8
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: Activation
    config:
      activation: relu
      name: activation_5
      trainable: true
    inbound_nodes:
    - - - conv2d_8
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_9
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_4
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_9
        - 0
        - 0
        - {}
    name: lambda_4
  - class_name: Add
    config:
      name: add_4
      trainable: true
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - &id006 {}
      - - lambda_4
        - 0
        - 0
        - *id006
    name: add_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_10
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: Activation
    config:
      activation: relu
      name: activation_6
      trainable: true
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_11
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_5
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - {}
    name: lambda_5
  - class_name: Add
    config:
      name: add_5
      trainable: true
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - &id007 {}
      - - lambda_5
        - 0
        - 0
        - *id007
    name: add_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_12
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: Activation
    config:
      activation: relu
      name: activation_7
      trainable: true
    inbound_nodes:
    - - - conv2d_12
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_13
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_6
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: lambda_6
  - class_name: Add
    config:
      name: add_6
      trainable: true
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - &id008 {}
      - - lambda_6
        - 0
        - 0
        - *id008
    name: add_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_14
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - {}
    name: conv2d_14
  - class_name: Activation
    config:
      activation: relu
      name: activation_8
      trainable: true
    inbound_nodes:
    - - - conv2d_14
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_15
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: conv2d_15
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_7
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_15
        - 0
        - 0
        - {}
    name: lambda_7
  - class_name: Add
    config:
      name: add_7
      trainable: true
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - &id009 {}
      - - lambda_7
        - 0
        - 0
        - *id009
    name: add_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_16
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_7
        - 0
        - 0
        - {}
    name: conv2d_16
  - class_name: Activation
    config:
      activation: relu
      name: activation_9
      trainable: true
    inbound_nodes:
    - - - conv2d_16
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_17
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: conv2d_17
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_8
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_17
        - 0
        - 0
        - {}
    name: lambda_8
  - class_name: Add
    config:
      name: add_8
      trainable: true
    inbound_nodes:
    - - - add_7
        - 0
        - 0
        - &id010 {}
      - - lambda_8
        - 0
        - 0
        - *id010
    name: add_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_18
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_8
        - 0
        - 0
        - {}
    name: conv2d_18
  - class_name: Activation
    config:
      activation: relu
      name: activation_10
      trainable: true
    inbound_nodes:
    - - - conv2d_18
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_19
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: conv2d_19
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_9
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_19
        - 0
        - 0
        - {}
    name: lambda_9
  - class_name: Add
    config:
      name: add_9
      trainable: true
    inbound_nodes:
    - - - add_8
        - 0
        - 0
        - &id011 {}
      - - lambda_9
        - 0
        - 0
        - *id011
    name: add_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_20
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_9
        - 0
        - 0
        - {}
    name: conv2d_20
  - class_name: Activation
    config:
      activation: relu
      name: activation_11
      trainable: true
    inbound_nodes:
    - - - conv2d_20
        - 0
        - 0
        - {}
    name: activation_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_21
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_11
        - 0
        - 0
        - {}
    name: conv2d_21
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_10
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_21
        - 0
        - 0
        - {}
    name: lambda_10
  - class_name: Add
    config:
      name: add_10
      trainable: true
    inbound_nodes:
    - - - add_9
        - 0
        - 0
        - &id012 {}
      - - lambda_10
        - 0
        - 0
        - *id012
    name: add_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_22
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_10
        - 0
        - 0
        - {}
    name: conv2d_22
  - class_name: Activation
    config:
      activation: relu
      name: activation_12
      trainable: true
    inbound_nodes:
    - - - conv2d_22
        - 0
        - 0
        - {}
    name: activation_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_23
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_12
        - 0
        - 0
        - {}
    name: conv2d_23
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_11
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_23
        - 0
        - 0
        - {}
    name: lambda_11
  - class_name: Add
    config:
      name: add_11
      trainable: true
    inbound_nodes:
    - - - add_10
        - 0
        - 0
        - &id013 {}
      - - lambda_11
        - 0
        - 0
        - *id013
    name: add_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_24
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_11
        - 0
        - 0
        - {}
    name: conv2d_24
  - class_name: Activation
    config:
      activation: relu
      name: activation_13
      trainable: true
    inbound_nodes:
    - - - conv2d_24
        - 0
        - 0
        - {}
    name: activation_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_25
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_13
        - 0
        - 0
        - {}
    name: conv2d_25
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_12
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_25
        - 0
        - 0
        - {}
    name: lambda_12
  - class_name: Add
    config:
      name: add_12
      trainable: true
    inbound_nodes:
    - - - add_11
        - 0
        - 0
        - &id014 {}
      - - lambda_12
        - 0
        - 0
        - *id014
    name: add_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_26
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_12
        - 0
        - 0
        - {}
    name: conv2d_26
  - class_name: Activation
    config:
      activation: relu
      name: activation_14
      trainable: true
    inbound_nodes:
    - - - conv2d_26
        - 0
        - 0
        - {}
    name: activation_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_27
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_14
        - 0
        - 0
        - {}
    name: conv2d_27
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_13
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_27
        - 0
        - 0
        - {}
    name: lambda_13
  - class_name: Add
    config:
      name: add_13
      trainable: true
    inbound_nodes:
    - - - add_12
        - 0
        - 0
        - &id015 {}
      - - lambda_13
        - 0
        - 0
        - *id015
    name: add_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_28
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_13
        - 0
        - 0
        - {}
    name: conv2d_28
  - class_name: Activation
    config:
      activation: relu
      name: activation_15
      trainable: true
    inbound_nodes:
    - - - conv2d_28
        - 0
        - 0
        - {}
    name: activation_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_29
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_15
        - 0
        - 0
        - {}
    name: conv2d_29
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_14
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_29
        - 0
        - 0
        - {}
    name: lambda_14
  - class_name: Add
    config:
      name: add_14
      trainable: true
    inbound_nodes:
    - - - add_13
        - 0
        - 0
        - &id016 {}
      - - lambda_14
        - 0
        - 0
        - *id016
    name: add_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_30
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_14
        - 0
        - 0
        - {}
    name: conv2d_30
  - class_name: Activation
    config:
      activation: relu
      name: activation_16
      trainable: true
    inbound_nodes:
    - - - conv2d_30
        - 0
        - 0
        - {}
    name: activation_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_31
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_16
        - 0
        - 0
        - {}
    name: conv2d_31
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_15
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_31
        - 0
        - 0
        - {}
    name: lambda_15
  - class_name: Add
    config:
      name: add_15
      trainable: true
    inbound_nodes:
    - - - add_14
        - 0
        - 0
        - &id017 {}
      - - lambda_15
        - 0
        - 0
        - *id017
    name: add_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_32
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_15
        - 0
        - 0
        - {}
    name: conv2d_32
  - class_name: Activation
    config:
      activation: relu
      name: activation_17
      trainable: true
    inbound_nodes:
    - - - conv2d_32
        - 0
        - 0
        - {}
    name: activation_17
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: conv2d_33
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_17
        - 0
        - 0
        - {}
    name: conv2d_33
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA

        APoyL2hvbWUvY29keS9kc3BhdGgvZHNlbjItY3IvQ29kZS9kc2VuMmNyX25ldHdvcmsucHnaCDxs

        YW1iZGE+DwAAAPMAAAAA

        '
      - null
      - !!python/tuple
        - 0.1
      function_type: lambda
      name: lambda_16
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - conv2d_33
        - 0
        - 0
        - {}
    name: lambda_16
  - class_name: Add
    config:
      name: add_16
      trainable: true
    inbound_nodes:
    - - - add_15
        - 0
        - 0
        - &id018 {}
      - - lambda_16
        - 0
        - 0
        - *id018
    name: add_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_first
      dilation_rate: *id002
      filters: 13
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id019
      name: conv2d_34
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - add_16
        - 0
        - 0
        - {}
    name: conv2d_34
  - class_name: Add
    config:
      name: add_17
      trainable: true
    inbound_nodes:
    - - - conv2d_34
        - 0
        - 0
        - &id020 {}
      - - input_1
        - 0
        - 0
        - *id020
    name: add_17
  - class_name: Concatenate
    config:
      axis: 1
      name: concatenate_2
      trainable: true
    inbound_nodes:
    - - - add_17
        - 0
        - 0
        - &id021 {}
      - - input_1
        - 0
        - 0
        - *id021
    name: concatenate_2
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAAAQAAAAgAAAATAAAAcyoAAAB0AGoBfAB0AGoCiABkAXQDZAIZAHQDZAMZAGYEZASN

        AWcCZAFkBY0CUwApBk7pAQAAAOkCAAAA6QMAAAApAdoFc2hhcGUpAdoEYXhpcykE2gFL2gtjb25j

        YXRlbmF0ZdoFemVyb3PaB3NoYXBlX24pAdoBeCkB2g1iYXRjaF9wZXJfZ3B1qQD6Mi9ob21lL2Nv

        ZHkvZHNwYXRoL2RzZW4yLWNyL0NvZGUvZHNlbjJjcl9uZXR3b3JrLnB52hFjb25jYXRlbmF0ZV9h

        cnJheTwAAABzAgAAAAAC

        '
      - null
      - !!python/tuple
        - 16
      function_type: lambda
      name: lambda_17
      output_shape: null
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: lambda_17
  name: model_1
  output_layers:
  - - lambda_17
    - 0
    - 0
keras_version: 2.2.4
